## cloud_asset_inventory
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.asset_inventory_cartography will be created
  + resource "aws_cloudwatch_event_rule" "asset_inventory_cartography" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "cartography"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 22 * * ? *)"
      + tags_all            = (known after apply)
    }

  # aws_cloudwatch_event_target.sfn_events will be created
  + resource "aws_cloudwatch_event_target" "sfn_events" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "cartography"
      + target_id      = (known after apply)
    }

  # aws_iam_policy.asset_inventory_cartography_state_machine will be created
  + resource "aws_iam_policy" "asset_inventory_cartography_state_machine" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "CartographyStateMachineECSLambda"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecs:ListTasks"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:ca-central-1:794722365809:cluster/cartography"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "ecs:RunTask"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecs:ca-central-1:794722365809:task-definition/neo4j_ingestor:2"
                      + Sid      = ""
                    },
                  + {
                      + Action   = "lambda:InvokeFunction"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:lambda:ca-central-1:794722365809:function:launch_cartography"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # aws_iam_role.asset_inventory_cartography_state_machine will be created
  + resource "aws_iam_role" "asset_inventory_cartography_state_machine" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.ca-central-1.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "secopsAssetInventoryNeo4JIngestorRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.asset_inventory_cartography_state_machine will be created
  + resource "aws_iam_role_policy_attachment" "asset_inventory_cartography_state_machine" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "secopsAssetInventoryNeo4JIngestorRole"
    }

  # aws_sfn_state_machine.asset_inventory_cartography will be created
  + resource "aws_sfn_state_machine" "asset_inventory_cartography" {
      + arn           = (known after apply)
      + creation_date = (known after apply)
      + definition    = jsonencode(
            [
              + {
                  + Comment        = "Run daily asset inventory of cloud assets"
                  + StartAt        = "Get running cartography services from previous run"
                  + States         = {
                      + "Check if cartography is still running"              = {
                          + Choices = [
                              + {
                                  + IsPresent = true
                                  + Next      = "Wait"
                                  + Variable  = "$.TaskArns[0]"
                                },
                            ]
                          + Default = "Ingest data from Neo4j to Elasticsearch"
                          + Type    = "Choice"
                        }
                      + "Get running cartography services"                   = {
                          + Next       = "Check if cartography is still running"
                          + Parameters = {
                              + Cluster = "cartography"
                            }
                          + Resource   = "arn:aws:states:::aws-sdk:ecs:listTasks"
                          + Type       = "Task"
                        }
                      + "Get running cartography services from previous run" = {
                          + Next       = "Is previous cartography still running"
                          + Parameters = {
                              + Cluster = "cartography"
                            }
                          + Resource   = "arn:aws:states:::aws-sdk:ecs:listTasks"
                          + Type       = "Task"
                        }
                      + "Ingest data from Neo4j to Elasticsearch"            = {
                          + End        = true
                          + Parameters = {
                              + Cluster        = "neo4j_ingestor"
                              + LaunchType     = "FARGATE"
                              + TaskDefinition = "neo4j_ingestor"
                            }
                          + Resource   = "arn:aws:states:::ecs:runTask"
                          + Type       = "Task"
                        }
                      + "Is previous cartography still running"              = {
                          + Choices = [
                              + {
                                  + IsPresent = true
                                  + Next      = "Pass"
                                  + Variable  = "$.TaskArns[0]"
                                },
                            ]
                          + Default = "Launch cartography"
                          + Type    = "Choice"
                        }
                      + "Launch cartography"                                 = {
                          + Next       = "Wait for scans to run"
                          + OutputPath = "$.Payload"
                          + Parameters = {
                              + FunctionName = "arn:aws:lambda:ca-central-1:794722365809:function:launch_cartography:$LATEST"
                            }
                          + Resource   = "arn:aws:states:::lambda:invoke"
                          + Retry      = [
                              + {
                                  + BackoffRate     = 2
                                  + ErrorEquals     = [
                                      + "Lambda.ServiceException",
                                      + "Lambda.AWSLambdaException",
                                      + "Lambda.SdkClientException",
                                    ]
                                  + IntervalSeconds = 2
                                  + MaxAttempts     = 6
                                },
                            ]
                          + Type       = "Task"
                        }
                      + Pass                                                 = {
                          + End  = true
                          + Type = "Pass"
                        }
                      + Wait                                                 = {
                          + Next    = "Get running cartography services"
                          + Seconds = 1800
                          + Type    = "Wait"
                        }
                      + "Wait for scans to run"                              = {
                          + Next    = "Get running cartography services"
                          + Seconds = 3600
                          + Type    = "Wait"
                        }
                    }
                  + TimeoutSeconds = 86400
                },
            ]
        )
      + id            = (known after apply)
      + name          = "asset-inventory-cartography"
      + role_arn      = (known after apply)
      + status        = (known after apply)
      + tags          = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + tags_all      = {
          + "CostCentre" = "security-tools-794722365809"
          + "Product"    = "security-tools-cloud-asset-inventory"
          + "Terraform"  = "true"
        }
      + type          = "STANDARD"

      + logging_configuration {
          + include_execution_data = (known after apply)
          + level                  = (known after apply)
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = (known after apply)
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.asset_inventory_cartography"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.asset_inventory_cartography_state_machine"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
